package main

/*
Требования:
В городе N есть управляющая компания, которая управляет только частными домами. В ее обязанности входит:
	1. Рассылка счетов на оплату за электричество, воду, газ и тепло во все дома, которые она обслуживает
	2. Реагирование на проблемы в любом из домов, которые она обслуживает.
Управляющая компания может подключить дом в городе N к обслуживанию.
Управляющая компания может отключать дом в городе N от обслуживания, как добровольно, так и принудительно если общая задолжность дома
превысила 100 000 рублей.
Дом может поменять управляющую компанию на другую, если у него нет долгов перед текущей управляющей компанией.

Задание:
	1. Спроектируйте доменную область для решения задачи
	2. Напишите код, который выполняет все функциональные требования

P.S.
Реагирование на проблемы = вывести в консоль "Ваше обращение принято. Мы работаем над решением"
*/
