package school

/*
В школе учится множество учеников. У ученика есть имя, возраст, пол, вес и рост.
Нужно сделать сводку по школе со следующей информацией:
1. Разбивка учеников по росту:
	< 150
	[150-160)
	[160-170)
	[170-180)
	>= 180
2. Кол-во мальчиков и девочек
3. кол-во учеников, которым уже 18 лет и больше.

Задания:
 1. Спроектировать struct для ученика и отчета
 2. Решить задачу
 3. Написать тесты
*/

func getSchoolReport(students []Student) Report {
	return Report{}
}

type Report struct {
}

type Student struct {
}
